cfd/cases/fluke_L1a28/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     overPimpleDyMFoam;
libs            ("liboverset.so" "libfvMotionSolvers.so");
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         1.5000;
deltaT          0.00039;
writeControl    adjustableRunTime;
writeInterval   0.0125;
purgeWrite      0;
writeFormat     binary;
writePrecision  8;
writeCompression on;
timeFormat      general;
timePrecision   7;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           0.8;
maxDeltaT       0.00156;
functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        patches         (paddle);
        rho             rhoInf;
        rhoInf          1000.0;
        CofR            (0.06345 0 0.00400);     // 力矩参考点 = 运动表原点（腿 = 髋轴 O2）；铰链力矩在后处理里换算
        writeControl    timeStep;
        writeInterval   1;
        log             false;
    }
    vorticity { type vorticity; libs ("libfieldFunctionObjects.so"); executeControl timeStep; writeControl writeTime; errors warn; }
    Q         { type Q;         libs ("libfieldFunctionObjects.so"); executeControl timeStep; writeControl writeTime; errors warn; }
    // 尾鳍表面压力（最后 2 个周期，每周期 40 帧）→ 弦向 Cp、压力中心
    finSurf
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    adjustableRunTime;
        writeInterval   0.012500;
        timeStart       0.500000;
        surfaceFormat   vtk;
        formatOptions   { vtk { format binary; } }
        interpolationScheme cellPoint;
        fields          (p);
        surfaces
        {
            fin { type patch; patches (paddle); interpolate false; }
        }
        errors          warn;
    }
    // 展向中截面 y = 0.0 mm（最后 2 个周期）→ 尾迹、LEV、涡量云图 / 动画
    midPlane
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    adjustableRunTime;
        writeInterval   0.012500;
        timeStart       0.500000;
        surfaceFormat   vtk;
        formatOptions   { vtk { format binary; } }
        interpolationScheme cellPoint;
        fields          (U p vorticity);
        surfaces
        {
            mid_c0 { type cuttingPlane; planeType pointAndNormal; pointAndNormalDict { point (0 0.000000 0); normal (0 1 0); } zones (c0); interpolate false; }
            mid_c1 { type cuttingPlane; planeType pointAndNormal; pointAndNormalDict { point (0 0.000000 0); normal (0 1 0); } zones (c1); interpolate false; }
        }
        errors          warn;
    }
}
