cfd/cases/fluke_L1a28/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}

actions
(
    { name c0; type cellSet; action new; source regionToCell; insidePoints ((-0.3521 -0.2278 -0.2911)); }
    { name c1; type cellSet; action new; source cellToCell; set c0; }
    { name c1; type cellSet; action invert; }
    { name c0; type cellZoneSet; action new; source setToCellZone; set c0; }
    { name c1; type cellZoneSet; action new; source setToCellZone; set c1; }
);
